{"features":[{"companyId":44,"features":[{"key":"Customizable design","value":"Yes, Zendesk offers customizable design features. Users can create custom pages from scratch and link to them from anywhere in their help center or from any other web page or application[3]. They can also customize the HTML templates for email notifications extensively[2]. Zendesk also offers custom themes that provide a fully tailored help center to match a user's brand ID[5]. Additionally, users can fine-tune their help center customization by optimizing the search experience, improving content architecture, and utilizing popular help center features[6]. However, Zendesk does not provide support for custom coding[2]."},{"key":"Customer feedback capture","value":"Yes, Zendesk offers customer feedback capture features. Zendesk enables businesses to gather customer feedback, review the data, and make improvements that align with company goals[3]. Here are some ways to capture customer feedback using Zendesk:\n\n- **Collect customer feedback as raw data**: This process could involve compiling social media responses or sending customer satisfaction surveys via email or text[3].\n- **Use a robust cloud ticketing system**: Analyze ticketing data to identify your customers' most common questions and concerns[2].\n- **Categorize feedback topics**: Use Zendesk to categorize feedback topics and support ticket history to find which issues arise most frequently so you can act on them quickly[4].\n- **Integrate with ChatGPT Ticket Summary by Premium Plus App**: This app summarizes tickets, captures sentiment and intent, and gives insight on Zendesk tickets right next to the ticket[5].\n- **Automate follow-ups and check-ins**: Automate follow-ups and check-ins for open tickets to gather qualitative feedback and ask additional questions after the issue is resolved[4].\n\nZendesk's customer feedback software can help businesses collaborate with their customers and make data-driven decisions[1]. By acting on customer feedback, businesses can address problems, expand upon aspects of their business that customers like, and show their audience that they care[3]."},{"key":"Cloud-based customer service platform","value":"Yes, Zendesk offers a cloud-based customer service platform feature. Zendesk is a leading customer support software platform that combines help desk features like ticketing and a Help Center with live chat and voice software. It is a cloud-based customer service platform that is designed to improve communication between the company and its customers. Zendesk is particularly powerful due to skill-based routing rules, which makes it easier to funnel your customers to the right support agent. Zendesk offers a complete customer service solution that is powerful yet easy to use and works right out of the box for a fast time to value. It is designed to help customer service agents work better together, maximizing their time and energy. Zendesk is versatile and can be used by universities, healthcare providers, financial institutions, e-commerce businesses, SaaS startups, and everything in between to achieve different goals. Zendesk is a multichannel customer service app that utilizes AI-powered bots and a robust ticketing system. It offers self-service, audio calls, and reporting capabilities, making it an excellent choice for businesses of all sizes[1][3][5]."},{"key":"Helpdesk support including ticket management and automation","value":"Yes, Zendesk offers a helpdesk support system that includes ticket management and automation features. Zendesk's Support Suite includes an automated ticketing system that uses machine learning to receive and process customer tickets[1]. The ticket management system allows you to collect helpdesk requests from various channels such as email, social media messaging, and chat, and track conversations in one central inbox[2]. You can easily assign tickets, add tags, use custom fields, and organize tickets into folders/views[3]. Additionally, Zendesk offers automation features such as ticket routing, escalation, alerts, and scripted responses[1]. This helps streamline your support workflow and allows your agents to respond to customer issues quickly[2]. Overall, Zendesk's helpdesk support system provides the necessary tools for efficient ticket management and automation."},{"key":"Call center features (call routing, recording, voicemail)","value":"Yes, Zendesk offers call center features such as call routing, recording, and voicemail. Their call center software, known as Zendesk Talk, is embedded in the Zendesk Agent Workspace for a seamless customer experience[1]. Some of the features offered by Zendesk's call center software include:\n\n- Call routing: Zendesk's solution provides interactive voice response (IVR) routing, group routing, and overflow and after-hours routing to ensure callers reach the right agent at the right time[5].\n\n- Call recording: Zendesk Talk automatically records details about a call, including the number dialed from, talk time, location, and the agent who answered the call[6].\n\n- Voicemail: Zendesk's call center software allows callers to leave voicemails when agents are unavailable[1].\n\nIn addition to these features, Zendesk's call center software also offers other functionalities such as call sentiment analysis, real-time text transcription, voice recognition, and omnichannel support[1]. It integrates with other channels and allows agents to see customer information right away, enabling businesses to measure and improve their phone support operations[2].\n\nOverall, Zendesk's call center software provides a comprehensive solution for managing and improving phone support operations."},{"key":"Customer support channels (live chat, email marketing, social media, mobile)","value":"Yes, Zendesk offers a Customer support channels feature that includes live chat, email, social media, mobile, and more[2][4][5][6]. The Zendesk Suite plan enables businesses to deliver personalized customer support across all of their business channels, including messaging across web, mobile, and social media, email, voice, SMS, and live chat support[2][5][6]. Zendesk integrates with social media platforms like Twitter and Facebook, and conversations on those networks can automatically be converted into tickets, allowing agents to respond to and resolve issues as effectively as any other channel[1]. Zendesk's messaging capability enables customers to request support, converse with the customizable messaging bot, and connect with an agent if they need further assistance. Messaging conversations become tickets that agents can update after the conversation ends. You can add messaging to your website, help center, mobile apps, and social channels[5]. Zendesk's live chat software enhances real-time interactions, while messaging allows for asynchronous conversations, meaning customers can pause a conversation on one channel and pick it up on another at a more convenient time[4]."},{"key":"Analytics and reporting including insights into customer engagement and support metrics","value":"Yes, Zendesk offers analytics and reporting features that provide insights into customer engagement and support metrics. Zendesk Explore is a reporting and analytics tool designed to help users analyze, understand, and share business information[1]. It provides powerful, prebuilt reports that help users view and analyze key information about their customers, support resources, and more. Zendesk provides prebuilt dashboards that contain information about product metrics, agent activity, and more. Depending on the Explore plan, users can use the prebuilt dashboards, create editable copies of them, or create completely new dashboards[1][2]. Zendesk Explore is accessed from the Zendesk product tray[2]. Zendesk's reporting and analytics software, known as Zendesk Explore, gives users instant access to customer insights that can make their business better[4]. The software provides powerful reporting to understand past trends and take action on what's happening in the moment[4]. Users can also use the legacy Reporting Overview to gain insight into how Zendesk Support is performing. It provides data about ticket volume and management, and enables users to compare key ticket metrics within Zendesk Support and with their peers[5]."},{"key":"Customization, integration and platform tools","value":"Yes, Zendesk offers customization, integration, and platform tools as part of its features. Here is a summary of the relevant information from the search results:\n\n- Zendesk Platform features include the ability to adapt the agent user interface, tailor Zendesk with no code configuration tools, build custom apps using the Zendesk apps framework, integrate support natively into mobile apps and websites, and use a comprehensive set of APIs for customization[1].\n- Zendesk Suite is an open and flexible CRM platform that allows developers to create custom apps, connect to external customer data, and extend the functionality of Zendesk[2].\n- Zendesk offers customer service software that is customizable and works out of the box. It allows for seamless communication, personalized customer experiences, and consolidation of interactions in one place through support channels like email, chat, and phone[3].\n- Zendesk Enterprise provides the ability to customize support by providing agents with a unified customer profile across channels and interaction history[4].\n- Zendesk offers AI-powered features that help agents be more productive, including ticket comment summarization and enhancement using generative AI[5].\n- Zendesk's bot builder allows for easy customization and deployment of bots across messaging channels without requiring any code. It also provides AI-powered content cues for improving knowledge bases[6].\n\nIn summary, Zendesk offers a range of customization, integration, and platform tools to tailor its customer service software to the specific needs of businesses and enhance the customer support experience."},{"key":"Messaging platform with targeted messages and conversation automation","value":"Yes, Zendesk offers a messaging platform with targeted messages and conversation automation features. With Zendesk, you can have conversational experiences with your customers across messaging channels, including web, mobile, or social apps. It’s easy to automate right out of the box, or you can customize it with their open and flexible platform. Messaging provides all of these capabilities out-of-the-box. Simply set up a few configuration options and you’ll be ready to go. Establish links to your social and mobile channels easily. Even Flow Builder uses a graphical interface and does not require any code to create or maintain multiple conversation flows. Zendesk's messaging platform allows you to support multiple conversational styles, from live, real-time chat functionality to asynchronous communication with your customers. You can also create conversational bots that can automate deflection options and triage support issues before (or instead of) handing the conversation over to a live agent. Zendesk's messaging platform is available with Zendesk Suite or Support + Chat (Team plan or higher) [1][3][6]."},{"key":"Knowledge base creation and management","value":"Yes, Zendesk offers a Knowledge Base creation and management feature. With Zendesk Guide, you can create a help center that contains your knowledge base articles and the support portal you provide to your customers[3]. The Knowledge Base software provided by Zendesk allows you to create, organize, and share self-service content[1]. You can create language-specific versions of your articles in over 40 different languages, making it accessible to a wide range of users[1]. Zendesk's Knowledge Base software also includes features such as intelligent knowledge management, AI-powered content cues, team and scheduled publishing, content blocks, content tags, and more[1].\n\nUsing Zendesk's Knowledge Base software, you can easily create and track tickets, seek out solutions to customer issues, and ensure that everyone in your organization is working with the most accurate information[4]. It provides an intuitive interface that is easy to use and customize[6]. Additionally, Zendesk offers analytics and dashboards to help you measure and improve customer support[6].\n\nOverall, Zendesk's Knowledge Base software is designed to simplify the process of creating, organizing, and sharing self-service content, making it easier for both customers and support agents to find the information they need[1][2][3]."},{"key":"Product tours","value":"Based on the search results, there is no clear indication that Zendesk offers a specific feature called \"Product Tours.\" However, Zendesk does offer Zendesk Explore, which is an add-on product that provides a base for collecting, measuring, and analyzing data about customers and their experience[2]. Additionally, Zendesk for Service is an end-to-end solution for managing customer service experience, including help desk and conversational messaging support[3]. While product tour software is a tool designed for building in-app product tours for user onboarding, it is not clear if Zendesk offers this specific feature[4]."},{"key":"cloud-based customer service platform","value":"Yes, Zendesk offers a cloud-based customer service platform feature. Zendesk provides a complete customer service solution that is powerful yet easy to use and works right out of the box for a fast time to value. It is designed to help customer service agents work better together, maximizing their time and energy. Zendesk offers AI-powered chatbots, fast-response messaging, and a fully integrated help center, allowing customers to find what they are looking for. Zendesk also has customizable self-service software that lets businesses create easy-to-use portals for their customer base that match the look and feel of their brand. Additionally, Zendesk provides powerful analytics tools to give businesses the best possible data to consistently refine their customer self-service tools[1][2][3][4][5][6]."},{"key":"helpdesk support","value":"Yes, Zendesk offers a helpdesk support feature[3][4][6]. Zendesk is a software that helps businesses provide technical support to employees and customers[3]. It allows companies to reply to customers across channels from the same workspace, track, manage, and prioritize conversations at scale with advanced tools like AI[4]. Zendesk also offers customizable response templates that help agents deliver fast support and provide customers or employees with ticket status updates[6]. Zendesk's IT ticket templates are pre-built forms for ticket submissions within employee or client portals and help desk articles[6]. Zendesk also provides several AI-powered features that help agents be more productive while still providing a high level of customer service, such as summarization and enhancing ticket comments[1]."},{"key":"ticket management","value":"Yes, Zendesk offers a ticket management feature. Here are some details about the ticket management features provided by Zendesk:\n\n- **Summarization**: Zendesk offers an AI-powered summarization feature that recaps the comments that have been added to a ticket so far. This helps agents get up to speed quickly and respond to customers more efficiently[1].\n\n- **Ticket Summary App**: Zendesk also has a sidebar app called ChatGPT Ticket Summary by Premium Plus. This app provides a summary of the problem, an overview of the proposed solution, and sentiment analysis right next to the ticket. Agents can add these items as tags or internal comments to make reporting easier[2].\n\n- **Create Ticket from Response**: Zendesk allows users to create new tickets from responses. This feature is useful when customers respond to an existing ticket and a new ticket needs to be created[3].\n\n- **First Reply Time**: Zendesk Support records the time from when a ticket is created to the first public agent response. This metric, known as First reply time, can be used to understand and track response times[4].\n\nIt's important to note that Zendesk offers various other features for customer service and support, such as helpdesk, CRM system, and more[6]. However, the focus here is on the ticket management features specifically."},{"key":"automation","value":"Yes, Zendesk offers automation features to help manage workflow and improve performance in customer service. Automations in Zendesk define conditions and actions that modify ticket properties and can send email notifications[3]. Some examples of automations include notifying agents when a ticket remains unresolved for a certain number of hours, closing tickets after a specified number of days, and finding \"abandoned\" tickets that haven't been updated for a certain number of days[3].\n\nIn addition to automations, Zendesk also offers AI-powered features that enhance ticket comments. This includes a summarization feature that recaps the comments added to a ticket, helping agents get up to speed and respond more quickly[1][2]. These AI-powered features utilize generative AI powered by OpenAI's Enterprise GPT[1].\n\nFurthermore, Zendesk provides Advanced AI as an add-on for Suite Professional and Enterprise plans. This add-on expands on the AI offerings already built into the Zendesk Suite and includes features such as intelligent triage, advanced bots, and intelligence in the context panel[5].\n\nOverall, Zendesk offers a range of automation and AI-powered features to streamline customer service operations and improve agent productivity."},{"key":"live chat","value":"Yes, Zendesk offers a live chat feature. According to[5], Zendesk's live chat software pairs perfectly with their messaging platform to deliver deeper conversational experiences. Live chat enhances real-time interactions, while messaging allows for asynchronous conversations. However, it is important to note that the live chat feature is different from messaging, which is a more comprehensive platform that includes live chat as one of its features. Additionally, it is worth mentioning that Zendesk offers several AI-powered features that help agents be more productive while still providing a high level of customer service, including summarization, which recaps the comments that have been added to a ticket so far, helping agents get up to speed and respond to customers more quickly[2]."},{"key":"call center software features (call routing, call recording, voicemail)","value":"Yes, Zendesk offers call center software features such as call routing, call recording, and voicemail. Zendesk's call center software is embedded in the Zendesk Agent Workspace for a seamless customer experience[1]. The software helps growing teams quickly resolve issues while measuring and improving phone support operations[1]. Zendesk's integrated voice solution syncs with all other channels and lets agents see all customer information right away[2]. The software also features interactive voice response (IVR) routing, group routing, and overflow and after-hours routing to ensure callers always reach the right agent at the right time[2][3][4]. Zendesk also provides call monitoring software that allows supervisors to track and assess all agent interactions with customers, including call recordings, customer conversations, and queue volumes that are shown with real-time metrics and reporting[5]."},{"key":"email marketing","value":"After searching for information on Zendesk's email marketing feature, it appears that the company does not offer a specific email marketing feature. However, Zendesk Sell does offer email automation and email intelligence features that can help sales and marketing teams send personalized emails at scale, track email metrics, and group contacts by type[4][5]. Additionally, Zendesk offers AI-powered features that can help agents summarize and enhance ticket comments, which can help them respond to customers more quickly[2][6]."},{"key":"self-service portal","value":"Yes, Zendesk offers a self-service portal feature[1][2][4]. Zendesk's customizable self-service software allows businesses to create easy-to-use portals for their customers that match the look and feel of their brand. The self-service portal feature is designed to help customers find answers to their questions quickly and efficiently, without having to wait on hold for help[2]. Zendesk's self-service portal also hosts powerful analytics tools to give businesses the best possible data to consistently refine their customer service[1]."},{"key":"social media support","value":"Yes, Zendesk offers a social media support feature[1]. Zendesk integrates with social media platforms like Twitter and Facebook, and conversations on those networks can automatically be converted into tickets, allowing agents to respond to and resolve issues as effectively as any other channel. Zendesk also enables agents to switch between public conversations, such as Tweets, to private conversations with customers or other agents, ensuring sensitive information is never publicly broadcast. The entire experience is streamlined and all conversations and data are captured in a single location, so agents can provide personalized service experiences to customers[1]."},{"key":"mobile support","value":"Yes, Zendesk offers a mobile support feature through its native mobile apps for iPhone and Android[3]. The Zendesk mobile app allows agents to catch up with tickets, create new tickets on the fly, and make quick updates with macros. Notifications alert agents to updates on their assigned tickets, and they can filter through the queue with views and swipe to easily move to the next ticket[3]. However, it is not clear from the search results whether the mobile app has a specific feature for mobile support."},{"key":"reporting and analytics","value":"Yes, Zendesk offers a reporting and analytics feature. Zendesk Explore is a tool designed to help users analyze, understand, and share business information[4]. It provides pre-built reports that help users view and analyze key information about their customers, support resources, and more. Users can also use the tools in Explore to build their own reports tailored to their unique needs[4]. Zendesk also offers other reporting tools such as the Reporting Overview, which provides data about ticket volume and management[2], and the Knowledge Base dashboard, which helps users monitor their help center traffic and activity[3]. Additionally, Zendesk provides a Weekly Analytics Report that contains an easy-to-review summary of the chats agents have had over a one-week period[6]."},{"key":"customization and integration","value":"Yes, Zendesk offers customization and integration features. Here is a summary of the information from the search results:\n\n- **Customization**: Zendesk allows you to tailor your Zendesk platform to your organization's unique structure and processes. You can adapt the agent user interface or customize Zendesk in just a few clicks using no code configuration tools in the Admin Center[1]. Additionally, you can customize the Web Widget (Classic) by adding code to the HTML of your website[2]. \n\n- **Integration**: Zendesk provides a comprehensive set of APIs that allow you to extend and customize your Zendesk platform. You can create custom integrations between Zendesk and other systems using Conversational Data Orchestration[1]. There is also an integration between Zendesk Support and Jira, which encourages collaboration between product teams and the support team. For example, you can create a new Jira issue from a ticket in Zendesk or link to an existing Jira issue[4].\n\n- **Unified Customer Profile**: Zendesk Enterprise offers a feature that provides agents with a unified customer profile across channels, including interaction history, to provide personalized support[3].\n\n- **Reporting and Analytics**: Zendesk Explore is an add-on that allows you to collect, measure, and analyze data about your customer service. It provides detailed, advanced reporting and analytics for enterprise organizations[6].\n\nOverall, Zendesk offers customization options to tailor the platform to your organization's needs and integration capabilities to connect with other systems."},{"key":"customer messaging platform (Message threading, saved replies, targeted messages)","value":"Yes, Zendesk offers a customer messaging platform that includes message threading, saved replies, and targeted messages. Zendesk allows businesses to add messaging to their website, mobile app, popular social media like WhatsApp and Facebook, and even tools like Slack. Zendesk's messaging platform integrates seamlessly with other Zendesk Suite products, enabling businesses to create personalized customer experiences, as all customer interactions and data are easily accessible across platforms. Zendesk also has AI-powered chatbots that can handle routine customer queries, enabling agents to handle the more complex issues. Zendesk Messaging is a larger app that, on top of live chat on your website, lets you have conversations on messaging apps like Facebook Messenger and WhatsApp. The tool centralizes all of these conversations so the agent can quickly switch channels[1][2][3][4][5][6]."},{"key":"team collaboration tools","value":"Yes, Zendesk offers team collaboration tools that empower teams to collaborate with features like side conversations and seamless integration with collaboration tools like Slack, Zoom, Teams, and Atlassian[1][3][4]. Zendesk also offers AI-powered features that help agents be more productive while still providing a high level of customer service, such as summarization and enhancing ticket comments[2][5]. Additionally, Zendesk Advanced AI is a set of features that expand on the AI offerings already built into the Zendesk Suite, including intelligent triage, advanced bots, intelligence in the context panel, and macro suggestions for admins, which promote seamless collaboration between teams[6]."},{"key":"knowledge base creation","value":"Yes, Zendesk offers a knowledge base creation feature. With Zendesk Guide, you can create, organize, and share self-service content to provide information and support to your customers or employees[3]. The knowledge base software provided by Zendesk is intuitive and easy to use, allowing you to create robust internal knowledge bases that can grow and improve over time[1]. You can create language-specific versions of your articles in over 40 different languages, making it accessible to a global audience[3]. Additionally, Zendesk provides reporting tools to measure knowledge base engagement and activity[6].\n\nOverall, Zendesk's knowledge base creation feature allows you to build a comprehensive and user-friendly knowledge base to support your customers or employees."},{"key":"AI-powered responses (Bots, customer engagement insights, customer satisfaction scores)","value":"Yes, Zendesk offers AI-powered features for customer service. These features include bots, customer engagement insights, and customer satisfaction scores. Here is a summary of the information from the search results:\n\n- Zendesk Advanced AI: This is an add-on for Suite Professional and Enterprise plans that expands on the AI offerings already built into the Zendesk Suite. It automates responses to customers, proactively requests missing information, and provides deeper reporting insights[1].\n\n- Zendesk AI: This is the intelligence layer of the Zendesk platform. It enhances every part of the service experience, including conversations with bots, productivity tools for agents, and insights for admins. It is included with Suite Professional and Enterprise plans[3].\n\n- AI-powered features: Zendesk offers several AI-powered features to help agents be more productive while providing a high level of customer service. These features include summarization, which recaps ticket comments, and enhancing, which automatically improves agent-written comments[4].\n\n- Intelligent triage: Zendesk AI can classify incoming customer requests, freeing up team capacity and reducing operating expenses[5].\n\n- Macro suggestions for admins: Zendesk AI can suggest shared responses for admins to help agents respond faster and more consistently[5].\n\n- Customer engagement insights: Zendesk AI can surface relevant help center articles in customer conversations and identify trending topics for knowledge management teams[5].\n\n- Customer satisfaction scores: The search results did not provide specific information about Zendesk offering customer satisfaction scores as an AI-powered feature. However, Zendesk AI aims to improve service experiences and create seamless interactions, which can contribute to customer satisfaction[6].\n\nOverall, Zendesk offers AI-powered features such as bots, customer engagement insights, and productivity tools for agents to enhance the customer service experience."},{"key":"product tours","value":"There is no clear answer to whether Zendesk offers a product tours feature based on the search results. None of the sources mention a product tours feature specifically. However, Zendesk does offer AI-powered features that help agents be more productive while still providing a high level of customer service, such as summarization and enhancing of ticket comments[1]. Zendesk primarily offers two main products: Zendesk for Service and Zendesk for Sales, which are end-to-end solutions for managing customer service experience and CRM solutions with various sales engagement tools and workflows, respectively[2]. Zendesk also offers Zendesk Explore, which is an arm of their product that gives users a base for collecting, measuring, and analyzing data about customers and their customer experience[4]."},{"key":"customizable design","value":"Yes, Zendesk offers customizable design features for different aspects of their platform. Here are some ways you can customize the design:\n\n- **Email Templates**: You can customize the HTML templates for email notifications sent from your Zendesk, including ticket notifications and Help Center article notifications. However, Zendesk does not provide support for custom coding[1]. You can also use the Email Template Builder app to design fully custom HTML templates for your Zendesk emails[5].\n\n- **Help Center Pages**: You can create up to 100 custom pages in your Help Center using the Zendesk Curlybars and HTML markup within Guide's theming editor, or you can create and develop the page outside of Zendesk and then import it as part of a theme into the help center[2]. You can also use custom themes from the Zendesk Marketplace to create a fully tailored Help Center that matches your brand[4].\n\n- **Chatbots**: In Zendesk messaging, you can create conversation bots with predefined, custom answers that tell the bot how to best respond to customer questions. You can use Flow Builder, Zendesk’s click-to-configure visual design tool, to create answers that include different actions like sending messages, presenting options, and showing help center articles[3].\n\nOverall, Zendesk provides several options for customizing the design of your customer service experience."},{"key":"feedback capture","value":"Yes, Zendesk offers a feedback capture feature. The GetFeedback app integration with Zendesk Support allows users to capture feedback immediately across multiple channels, including digital experiences[6]. Additionally, Zendesk's AI-powered features include summarization, which recaps the comments that have been added to a ticket so far, helping agents get up to speed and respond to customers more quickly[4]. However, it is unclear if Zendesk has a specific feature solely dedicated to capturing feedback from customers."},{"key":"third-party integrations","value":"Yes, Zendesk offers third-party integrations feature. Zendesk allows integration with third-party systems using webhooks, email targets, or other means[1][3]. Zendesk also offers several AI-powered features that help agents be more productive while still providing a high level of customer service[2][4][6]. Additionally, Zendesk provides a tutorial that shows how to use the Zendesk Apps framework (ZAF) to extend Zendesk using external AI systems[4]. There are also several apps available on the Zendesk Marketplace that integrate with Zendesk Support, such as the ChatGPT Ticket Summary by Premium Plus App Integration[5]."}]},{"companyId":43,"features":[{"key":"Cloud-based customer service platform","value":"Yes, Intercom offers a cloud-based customer service platform feature[3]. Intercom is a customer service solution that allows businesses to resolve issues faster and boost customer satisfaction while reducing team workload[3]. Intercom's plans contain different features that enable businesses to engage with their customers in different ways[2]. Intercom provides a fully customizable design that allows businesses to align all their brand and business needs while engaging customers in-context and driving action across their journey in the Intercom Messenger[2]. Intercom's platform includes a powerful Inbox built for support at scale, which goes beyond simple live chat and handles complex customer requests asynchronously with tickets built for cross-functional collaboration[2]. Intercom also provides automation features that allow businesses to automatically answer customer questions and resolve simple issues so that their team has more time for personal customer interactions[2]. Intercom's platform is easy to set up and customize, and it does exactly what it says[6]."},{"key":"Helpdesk support including ticket management and automation","value":"Yes, Intercom offers a Helpdesk support including ticket management and automation features. Intercom's ticketing system collects every customer support interaction, whether it comes via a messenger, email, or other channel. The system labels the interaction with an identifying number, issues that ticket ID to the customer, and keeps track of the ticket as it works its way through the behind-the-scenes resolution process, which might require the involvement of multiple teammates[1]. With Intercom's ticketing system, you can support your customers from beginning to end, all within the Intercom Messenger, and consolidate your tools to streamline the support process[4]. Additionally, Intercom offers advanced reporting, custom agent workflows, and detailed reports that shed light on every aspect of your team's performance[6]. Intercom's Helpdesk support is dedicated to optimizing workflows and improving operational efficiency, while helpdesk automation is focused on automating repetitive tasks to save time and effort[5]."},{"key":"Call center features (call routing, recording, voicemail)","value":"Intercom is a live chat and messaging platform that provides customer engagement software with some advanced features[3]. It offers a \"Reduce hold times for your customers and move phone conversations to the Messenger\" feature, which allows businesses to reduce hold times for customers and move phone conversations to the Messenger[1]. However, it is not clear from the search results whether Intercom offers call center features such as call routing, recording, and voicemail. Therefore, it is recommended to contact Intercom's customer support or sales team to inquire about the availability of these features."},{"key":"Customer support channels (live chat, email marketing, social media, mobile)","value":"Yes, Intercom offers a variety of customer support channels, including live chat, email, social media, and mobile support[1][2][3][4][5]. Intercom's Messenger is the heart of their customer communications strategy, providing a single, powerful platform for personalized support and engagement[1]. With Intercom's AI-powered chatbots and automation tools, businesses can reduce support volumes and increase customer satisfaction[1]. Intercom's Business Messenger also includes bots, apps, in-app messages, and more to connect businesses to customers like never before[2]. Intercom's support software offers a Messenger-first ticketing solution that provides personal, in-context resolutions to any type of customer query, from simple to complex[4][5]. Additionally, Intercom offers over 350 integrations for businesses' favorite tools[4]. Intercom's pricing plans include a variety of support features, such as Fin AI bot for customer service, team inboxes, ticketing, assignment rules and macros, workflows for chatbots and automations, phone deflection to Messenger, multilingual help center, and Salesforce integration[6]."},{"key":"Analytics and reporting including insights into customer engagement and support metrics","value":"Yes, Intercom offers analytics and reporting features that provide insights into customer engagement and support metrics[1][2][3][4][5][6]. Intercom's reports offer a breakdown of everything important to a business, including an overview report that gives a high-level overview of what's going on in the Intercom workspace, people report that shows new users and leads and how they've interacted with the team, and conversations report that shows new inbound messages and replies to the team[1]. Intercom also offers lead generation reports that give a clear look at how a team is generating new leads with Intercom, sales reports that show how sales are performing, and custom reports that help surface valuable insights from customer conversations[1][2]. Additionally, Intercom has an app store that offers analytics tools such as SupporTrends, which provides full sentiment analysis, NPS impact estimation, and feature-based action recommendations to help plot a clear feature and product[3][5]. Recently, Intercom has improved its reporting features, introduced new chart types, and new reports for better insights into customer engagement and support metrics[6]."},{"key":"Customization, integration and platform tools","value":"Yes, Intercom offers customization, integration, and platform tools features. Intercom is a customer service solution that allows users to resolve issues faster and boost customer satisfaction while reducing team workload. Intercom offers a fully customizable design that aligns with all brand and business needs, allowing users to engage customers in-context and drive action across their journey in the Intercom Messenger[1]. Intercom also offers a single, powerful, easy-to-use platform that allows users to get all their automation, conversations, tickets, customer data, and reporting working together seamlessly. Users can maximize team performance by connecting all their other tools to the Intercom platform[2]. Intercom also offers over 200 pre-built app integrations in the Intercom App Store, and each plan comes with different built-in integrations[5]. Additionally, Intercom offers APIs that allow users to seamlessly integrate Intercom with their own product, tech stack, or other tools[4]. Finally, Intercom offers a conversation summarization tool, which is an AI-powered beta feature that allows users to instantly summarize a conversation between their team and the customer, saving time and highlighting areas for improvement within the team[3]."},{"key":"Messaging platform with targeted messages and conversation automation","value":"Yes, Intercom offers a messaging platform with targeted messages and conversation automation features. \n\nIntercom's messaging platform allows businesses to automate conversations using AI-powered chatbots and automation tools. This helps reduce support volumes and increase customer satisfaction[1]. Intercom's Messenger can be integrated into a product, app, or website to build ongoing engagement with customers and foster long-lasting relationships[2]. \n\nWith Intercom's targeted messages feature, businesses can send automated in-app and website messages to connect with people when they are most ready to engage. Messages can be personalized based on user behavior, and the timing of the messages can be specified[3]. This allows businesses to drive growth and maximize the impact of their messages[3].\n\nAdditionally, Intercom offers an AI-powered chatbot called Fin, which is powered by OpenAI's GPT-4 and Intercom's proprietary machine learning technology. This chatbot can converse naturally and provide efficient customer service[5].\n\nOverall, Intercom provides a comprehensive messaging platform with targeted messages and conversation automation features to help businesses engage with their customers effectively."},{"key":"Knowledge base creation and management","value":"Yes, Intercom offers a Knowledge Base creation and management feature[1][4][6]. The Knowledge Base feature allows businesses to set up a central place for customers to find answers, tips, and other important information when they need it. The feature is optimized for the channels customers use, including websites, mobile apps, in-product messages, or chat. The Knowledge Base feature also allows businesses to create multilingual articles for their global customers for faster self-serve answers. The editor can be used to add images, videos, call-to-action buttons, and interactive guides to articles. Additionally, the Messenger on every article allows customers to instantly start a conversation if they need more help."},{"key":"customizable design","value":"Yes, Intercom offers a customizable design feature[1]. With a fully customizable design, you can align your brand and business needs while engaging customers in-context and driving action across their journey in the Intercom Messenger[1]. This allows you to personalize the appearance and layout of the Intercom interface to match your brand identity and create a seamless customer experience."},{"key":"feedback capture","value":"Yes, Intercom offers a feedback capture feature. According to the Intercom Help Center, the best time and place to ask for feedback is inside your app, and Intercom provides a way to capture customer feedback and use it to create a better customer experience[1]. Additionally, Rapidr explains how to track customer feedback and feature requests while conversing with customers in the Intercom Inbox[3]. While some other articles, such as Noora's blog post, discuss best practices for collecting and managing user feedback and feature requests in Intercom, they do not provide evidence that Intercom does not offer a feedback capture feature[4]."},{"key":"third-party integrations","value":"Yes, Intercom offers third-party integrations. According to their website, Intercom offers a huge library of integrations, both created by Intercom and created by third parties. Their App Store offers hundreds of integrations, and you're sure to find what you need[1]. There are also many articles and blog posts that list and recommend various third-party integrations with Intercom[2][4][6]. Intercom also provides information about their onward subprocessors that may process personal data submitted to Intercom's services by the controller[3]."},{"key":"Product tours","value":"Yes, Intercom offers a feature called Product Tours[1]. Product Tours are guided experiences that help customers discover and learn about a product, driving adoption and onboarding[1]. Here are some key details about Intercom's Product Tours feature:\n\n- **Drive onboarding and adoption**: Product Tours introduce customers to a product with interactive tours that help them discover everything they need to know[1].\n- **Highlight new features**: Product Tours can be used to boost feature adoption by highlighting what's new in a product at the perfect time[1].\n- **Multipage tours**: Intercom's Product Tours support multipage tours that allow users to click-to-advance and explore different aspects of a product[1].\n- **Targeted audience**: Product Tours can be automatically shown to a target audience on specific pages, such as paid customers visiting a new feature[3].\n- **No code setup**: Onboarding new customers with multi-page tours and automatically showing tours to target audiences can be done without any code[3].\n- **Sharing tours**: Product Tours can be shared with customers in conversations, messages, and bots, making it easy to engage customers everywhere[3].\n\nOverall, Intercom's Product Tours feature provides a powerful and personalized way to onboard and support customers, highlight new features, and drive adoption of a product[4]."},{"key":"Customizable design","value":"Yes, Intercom offers a fully customizable design feature[1]. This feature allows businesses to align their brand and business needs while engaging customers in-context and driving action across their journey in the Intercom Messenger. However, it is important to note that the search results do not provide detailed information on how to customize the design or what specific design elements can be customized."},{"key":"Customer feedback capture","value":"Yes, Intercom offers several features to capture customer feedback. Here are some of the relevant search results:\n\n- **Feedback by Userfeed**: This is an app available in the Intercom App Store that allows you to capture, manage, and analyze customer feedback seamlessly from Intercom[2].\n\n- **Acute Feedback**: Another app available in the Intercom App Store that allows you to capture, manage, and analyze customer feedback[4][5].\n\n- **Conflux**: This app makes it easy for you to capture feedback from conversations and keep track of what feature ideas are most important to your customers[6].\n\n- **Live Chat**: Intercom's live chat feature is a frictionless way for customers to communicate with you directly and provide feedback[3].\n\n- **Surveys**: Intercom also allows you to create short surveys to ask your customers specific questions regarding features, aspects of your platform, or parts of their experience[3].\n\nOverall, Intercom provides several tools and methods to gather customer feedback and learn about their pain points."},{"key":"cloud-based customer service platform","value":"Yes, Intercom offers a cloud-based customer service platform feature. Intercom is a leading customer service platform that provides a seamless customer experience across automation and human support[3]. It offers a range of features, including live and automated chat, targeted emails, push and in-app messages, and an integrated help desk[5]. Intercom allows businesses to interact with their customers on the internet and serves over 25,000 organizations[5]. It also offers solutions for personalized customer support and website visitor conversion[5]. Intercom has recently launched new automation-first features built using OpenAI's GPT-3.5 technology[2]. These features include conversation summarization, where support agents can view an AI-generated summary of a customer conversation within the Intercom Inbox[2]. Overall, Intercom provides a comprehensive cloud-based customer service platform for businesses."},{"key":"helpdesk support","value":"Yes, Intercom offers a helpdesk support feature. The Intercom Inbox is a powerful tool built for support at scale, designed to help teams resolve customer issues faster[1]. It goes beyond simple live chat and allows for handling complex customer requests asynchronously with tickets built for cross-functional collaboration[1]. Additionally, Intercom has introduced AI-powered beta features, including a conversation summarization tool, which allows managers to instantly summarize conversations between their team and customers, saving time and highlighting areas for improvement[4]. These features aim to enhance customer support and improve the overall experience for both customers and support teams."},{"key":"ticket management","value":"Yes, Intercom offers a ticket management feature[2][3][4][6]. Intercom's ticketing system is designed to handle customer requests and is built for cross-functional collaboration[3]. Support representatives can create tickets to capture requests on behalf of customers and seamlessly pass them on to the right team[4]. The ticketing system is fully integrated into the Intercom support solution, and tickets work in Inbox automation rules to route to the right team, update ticket states, and more[4]. The tickets feature allows for streamlined workflows, reduced lag time, better visibility into progress for all teammates and customers, and improved reporting on volume, efficiency, and productivity[4]. Additionally, tickets can be used in custom bot flows for customers to complete and submit[4]. With tickets, businesses can support their customers from beginning to end, all within the Intercom Messenger[6]."},{"key":"automation","value":"Yes, Intercom offers automation features. Intercom customers can automatically email their users as they meet certain criteria[1]. Intercom's AI customer service features include a conversation summarization tool and an Expand feature that allows users to quickly jot down notes during customer calls, which can then be expanded to full replies that can be sent as follow-up messages after the call[2]. Intercom's community forum includes a discussion about the possibility of creating auto-replies for conversations[3]. Intercom strives to balance automation and personalization in customer service, and offers automated solutions that empower customers and help support teams save time. Intercom's bots can access data outside of Intercom to provide even more self-serve answers for customers, which can reduce customer inquiries for support teams[4]. Intercom also offers SMS automation features that allow customers to ask questions and give feedback in the most convenient way, at the most convenient time[6]."},{"key":"live chat","value":"Yes, Intercom does offer a live chat feature. With Intercom's live chat, businesses can reach more customers personally and have dynamic conversations even when there's not somebody at the end of the messenger[1]. Intercom's Business Messenger also includes bots, apps, in-app messages, and more to connect businesses with customers in various ways[2]. Additionally, Intercom's live chat tools provide personal, in-context resolutions to customer queries, even if a support team member is not immediately available[4]. Intercom also offers features beyond simple live chat, such as handling complex customer requests asynchronously with tickets built for cross-functional collaboration[3]."},{"key":"call center software features (call routing, call recording, voicemail)","value":"Yes, Intercom offers call center software features such as call routing, call recording, and voicemail. Intercom Calling allows users to assign calls to their team right away, schedule them for later, or move them to a more effective channel with call deflection options[1]. Additionally, Intercom offers distribution software that routes customers to specific call centers based on the region from which they're calling, and call recording tools[4]. However, Intercom is primarily a customer service solution that combines automation and human support to resolve issues faster and boost customer satisfaction, while reducing team workload[6]."},{"key":"email marketing","value":"Yes, Intercom offers an email marketing feature[1][4]. With Intercom, businesses can send personalized emails to the right users based on who they are, what they do inside the product, and where they are in their customer journey[1]. Intercom provides a host of products aimed at helping businesses improve customer relationships, including live chat, chatbots, and email marketing[4]. While there is no free plan, prospective customers can try the Start and Grow plans for free for 14 days[4]. Intercom is an advanced conversational marketing tool that can automatically qualify leads through the use of targeted messaging and lead qualification[5]."},{"key":"self-service portal","value":"Yes, Intercom offers a self-service portal feature. Customers can access useful information and complete actions that help them resolve their issues through a branded website[4]. Intercom's Resolution Bot can automatically answer customer questions and resolve simple issues, allowing customers to self-serve effectively and reducing inbound conversation volume and repetitive questions for the support team[3][2]. Intercom also allows businesses to publish articles to a knowledge base to provide customers with self-serve support[3]."},{"key":"social media support","value":"Yes, Intercom offers a social media support feature. According to the Intercom website, users can automatically send emails and social media channels to teams or teammates in Intercom so they can handle all support requests from their team inbox[1]. Additionally, Intercom's AI-powered beta features include a conversation summarization tool that can summarize conversations between teams and customers, including those that take place on social media channels[4]. Therefore, Intercom can be used to manage social media support requests and provide better quality answers to customers."},{"key":"mobile support","value":"Based on the search results, it is unclear whether Intercom offers a mobile support feature. While Intercom does offer mobile push notifications and in-app messages[1], it is not clear if these features are specifically for support purposes. Intercom also offers SMS messaging[5], but it is not clear if this is for support purposes either. Intercom does offer a support solution that includes a powerful Inbox built for support at scale[1][4], but it is not clear if this Inbox can be accessed via a mobile device. Additionally, Intercom recently introduced a new feature called Intercom Switch, which allows businesses to move inbound call volume to messaging and scale their support offering[3], but it is not clear if this feature is available on mobile devices. Therefore, it is recommended to contact Intercom's customer support for more information on whether they offer a mobile support feature."},{"key":"reporting and analytics","value":"Yes, Intercom offers reporting and analytics features. Intercom's reports offer a breakdown of everything important to your business, whether you use Intercom for Convert, Support, or Engage. The reports provide a high-level overview of what’s going on in your Intercom workspace, including people, leads, and sales. Intercom also offers custom reports and conversation tags reports that help surface valuable insights from your customer conversations, vital for providing excellent support at scale. Additionally, Intercom has a real-time dashboard that allows support managers to get a clear overview of what’s happening across their support team, monitor the conversation volume across inboxes, and the rate your team is replying to customers, react quickly to any changes, and assign teammates to the areas where they’re most needed[1][2][4][5]."},{"key":"customization and integration","value":"Yes, Intercom offers customization and integration features. Here are some details:\n\nCustomization:\n- Intercom Messenger can be customized to match your brand. You can add an accent color, background color, background texture, and more[2].\n- You can greet each user personally by their first name, write your team intro, set your expected response time, localize the language of the Messenger, add Messenger apps to your Messenger home screen, and decide how you would like the Messenger to open[2].\n\nIntegration:\n- Intercom provides over 200 pre-built app integrations in the Intercom App Store[6].\n- With Custom Actions and Custom Objects, you can connect with external data in more flexible and customizable ways, so your customers can get immediate answers to even more questions[5].\n- Intercom's APIs allow developers to integrate Intercom with other products and create connected, personalized experiences[4].\n\nIn summary, Intercom offers customization and integration features that allow businesses to align all their brand and business needs while engaging customers in-context and driving action across their journey in the Intercom Messenger."},{"key":"customer messaging platform (Message threading, saved replies, targeted messages)","value":"Yes, Intercom offers a customer messaging platform with features such as message threading, saved replies, and targeted messages.\n\nMessage threading allows you to have organized and structured conversations with customers. It helps you keep track of the entire conversation history and easily follow the flow of communication[1].\n\nSaved replies are pre-written responses that can be used to quickly respond to common customer inquiries. They save time and ensure consistent and efficient customer support[1].\n\nTargeted messages allow you to send personalized messages to specific segments of your customer base. You can target people based on their behavior or attributes and deliver relevant messages at the right time[3].\n\nThese features are part of Intercom's customer messaging platform, which aims to provide a customizable and engaging messaging experience for businesses to interact with their customers[2].\n\nPlease note that the information provided is based on the search results and may be subject to change. It is recommended to visit Intercom's official website or documentation for the most up-to-date and accurate information about their features."},{"key":"team collaboration tools","value":"Yes, Intercom offers team collaboration tools features. One of the features is a conversation summarization tool powered by AI. This tool allows support reps to write summaries of customer support conversations before handing them over to teammates. It saves time by eliminating the need to read through lengthy conversations and helps highlight areas for improvement within the team. It also facilitates seamless ticket handoff when team members are unavailable[1].\n\nAdditionally, Intercom provides an Inbox that enables sales teams to work together in a collaborative team inbox. This feature allows teams to manage and reply to leads at scale[2].\n\nIntercom is a customer service solution that combines automation and human support. It offers a single, powerful, and easy-to-use platform that integrates automation, conversations, tickets, customer data, and reporting. This seamless integration maximizes team performance and reduces team workload[3].\n\nIt's worth noting that Intercom offers various other features and tools to engage with customers, resolve issues, and provide support at scale, such as outbound messages, Intercom bots for automated customer interactions, and customizable design options[4].\n\nOverall, Intercom provides team collaboration tools and features to enhance customer service and support operations."},{"key":"knowledge base creation","value":"Yes, Intercom offers a knowledge base creation feature[1][4]. The knowledge base is a self-serve online library of information about a product, service, or specific topic[3]. Intercom's knowledge base feature allows users to create a central place for customers to find answers, tips, and other important information when they need it. The knowledge base is optimized for the channels customers use, such as a website, mobile app, in-product messages, or chat. Users can create multilingual articles for their global customers to provide faster self-serve answers. The editor allows users to add images, videos, call-to-action buttons, and interactive guides to their articles to make them engaging[1]. Additionally, Intercom's Messenger is integrated with the knowledge base, allowing customers to instantly start a conversation if they need more help[1]."},{"key":"AI-powered responses (Bots, customer engagement insights, customer satisfaction scores)","value":"Yes, Intercom offers AI-powered features for customer service. Here are the key AI-powered features provided by Intercom:\n\n1. **Conversation Summarization**: Intercom's AI-powered Summarization feature allows users to instantly summarize conversations between their team and customers. This saves time and helps identify areas for improvement within the team[1][4].\n\n2. **AI Assist Inbox**: Intercom's AI Assist Inbox feature generates AI-generated summaries of customer conversations in the Intercom Inbox. This helps support reps quickly understand the content of the conversation[2].\n\n3. **AI Chatbot**: Intercom has developed an AI chatbot called Fin, which is built on GPT-4 technology. Fin can interpret complex customer queries and seamlessly pass harder questions to human support teams when necessary[3].\n\nThese AI-powered features aim to enhance customer engagement, provide customer insights, and improve customer satisfaction scores. Intercom's AI capabilities help streamline workflows, support more customers, and deliver better experiences at scale[4].\n\nPlease note that the availability of these features may vary depending on the Intercom plan and subscription."},{"key":"product tours","value":"Yes, Intercom offers a product tours feature[1][2][3][4]. This feature allows businesses to guide their customers with interactive tours that drive adoption, onboard new customers to their product, and support customers when they need guidance[2]. With product tours, businesses can introduce customers to their product with guided experiences that help them discover everything they need to know about the product[1]. The feature also allows businesses to automatically capture a new user's intent and then send them on the right tour directly from the conversation[1]. Additionally, businesses can automatically show tours to a target audience on a specific page, like paid customers who visit a new feature[4]. Intercom's product tours feature is available as an add-on to any plan[1]."}]}],"swots":[{"companyId":44,"SWOT":[{"strengths":"Established brand and diverse product offerings, Cloud-based helpdesk solution that is easy to deploy, Prioritizes customer needs and satisfaction, Offers a simple CRM like Zendesk Sell that makes communication between business development teams and other departments effortless"},{"weaknesses":"Pricing concerns, Does not tell management what to do"},{"opportunities":"Emerging trends and geographic expansion"},{"threats":"Competition in the customer service software industry"}]},{"companyId":43,"SWOT":[{"strengths":"Intercom provides a comprehensive solution that centralizes and streamlines customer interactions, The company leverages technology and strong partnerships to innovate and outperform competition, Intercom prioritizes user experiences and nurturing relevant connections, ensuring that its clients attain sustainable growth"},{"weaknesses":"Intercom's pricing is relatively high compared to some of its competitors, Intercom's platform may not be suitable for all businesses, particularly those with smaller customer bases"},{"opportunities":"Intercom could expand its services to target underserved markets, Intercom could develop new products to better serve a wider audience"},{"threats":"Intercom faces competition from other customer messaging platforms such as Zendesk, Drift, and Freshchat, The market for customer messaging platforms is becoming increasingly competitive, and Intercom must continue to innovate and adapt to remain relevant"}]}],"articles":[{"companyId":44,"articles":[]},{"companyId":43,"articles":[]}]}